In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
dataset=pd.read_csv("Social_Network_Ads.csv")
dataset

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [3]:
dataset=pd.get_dummies(dataset,drop_first=True)

In [4]:
dataset

      User ID  Age  EstimatedSalary  Purchased  Gender_Male
0    15624510   19            19000          0            1
1    15810944   35            20000          0            1
2    15668575   26            43000          0            0
3    15603246   27            57000          0            0
4    15804002   19            76000          0            1
..        ...  ...              ...        ...          ...
395  15691863   46            41000          1            0
396  15706071   51            23000          1            1
397  15654296   50            20000          1            0
398  15755018   36            33000          0            1
399  15594041   49            36000          1            0

[400 rows x 5 columns]

In [5]:
dataset["Purchased"].value_counts()

0    257
1    143
Name: Purchased, dtype: int64

dataset=dataset.drop("User ID",axis=1)

In [6]:
dataset.columns

Index(['User ID', 'Age', 'EstimatedSalary', 'Purchased', 'Gender_Male'], dtype='object')

In [7]:
independent=dataset[["User ID","Gender_Male", "Age", "EstimatedSalary"]]
independent

      User ID  Gender_Male  Age  EstimatedSalary
0    15624510            1   19            19000
1    15810944            1   35            20000
2    15668575            0   26            43000
3    15603246            0   27            57000
4    15804002            1   19            76000
..        ...          ...  ...              ...
395  15691863            0   46            41000
396  15706071            1   51            23000
397  15654296            0   50            20000
398  15755018            1   36            33000
399  15594041            0   49            36000

[400 rows x 4 columns]

In [8]:
dependent=dataset[["Purchased"]]
dependent

     Purchased
0            0
1            0
2            0
3            0
4            0
..         ...
395          1
396          1
397          1
398          0
399          1

[400 rows x 1 columns]

In [9]:
from sklearn.model_selection import train_test_split
X_train,X_test,Y_train,Y_test=train_test_split(independent,dependent,test_size=0.30,random_state=0)

In [40]:
from sklearn.svm import SVC
classifier=SVC(kernel="linear",random_state=0)
classifier.fit(X_train,Y_train)

C:\Users\Admin\Anaconda3\lib\site-packages\sklearn\utils\validation.py:985: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

SVC(kernel='linear', random_state=0)

In [41]:
Y_pred=classifier.predict(X_test)

In [42]:
from sklearn.metrics import confusion_matrix
cm=confusion_matrix(Y_test,Y_pred)

In [43]:
print(cm)

[[77  2]
 [24 17]]

In [44]:
from sklearn.metrics import classification_report
clf_report=classification_report(Y_test,Y_pred)

In [45]:
print(clf_report)

              precision    recall  f1-score   support

           0       0.76      0.97      0.86        79
           1       0.89      0.41      0.57        41

    accuracy                           0.78       120
   macro avg       0.83      0.69      0.71       120
weighted avg       0.81      0.78      0.76       120